tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "liftoffcli/formulae"
tap "thecasualcoder/stable"
tap "vitorgalvao/tiny-scripts"
cask "java"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Slice and dice log files on the command-line
brew "angle-grinder"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# Asynchronous event library
brew "libevent"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", link: false
# Image manipulation library
brew "jpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Edit preview images and fix bounding boxes in EPS files
brew "epstool"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Translates figures generated by xfig to other formats
brew "fig2dev"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Cross-platform C++ GUI toolkit
brew "fltk"
# Command-line fuzzy finder written in Go
brew "fzf"
# Test automation tool that supports executable documentation
brew "gauge"
# Graphics library to dynamically manipulate images
brew "gd"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# OpenGL to PostScript printing library
brew "gl2ps"
# Library for Linear and Mixed-Integer Programming
brew "glpk"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Implementation of extended-Rice lossless compression algorithm
brew "szip"
# File format designed to store large amounts of data
brew "hdf5"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# The Kubernetes package manager
brew "kubernetes-helm"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# C library for files containing sampled sound
brew "libsndfile"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# GUI for vim, made for macOS
brew "macvim", link: false
# Utility for directing compilation
brew "make"
# Hash utilities
brew "md5sha1sum", link: false
# Programs that partition graphs and order matrices
brew "metis"
# Menu-driven communications program
brew "minicom"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# C/C++ function library for exporting 2-D vector graphics
brew "plotutils"
# Cross-platform library for audio I/O
brew "portaudio"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Computes convex hulls in n dimensions
brew "qhull"
# High-level interpreted language for numerical computing
brew "octave"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# Show ps output as a tree
brew "pstree"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Manipulate Xcode project files
brew "xcproj"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# UNIX shell (command interpreter)
brew "zsh"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# Tiling window manager for macOS based on plugin architecture
brew "koekeishiya/formulae/chunkwm"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
brew "liftoffcli/formulae/liftoff"
# Shell function to fuzzy search an IPSec VPN by name and connect to it automatically.
brew "thecasualcoder/stable/lazy-connect"
cask "abricotine"
cask "adium"
cask "alacritty"
cask "amazon-music"
cask "appcleaner"
cask "atom"
cask "bitwarden"
cask "boostnote"
cask "caffeine"
cask "docker"
cask "etcher"
cask "evernote"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-fira-code"
cask "font-fontawesome"
cask "github-desktop"
cask "gitter"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "java8"
cask "keybase"
cask "kindle"
cask "kitematic"
cask "lepton"
cask "macdown"
cask "macvim"
cask "minikube"
cask "notion"
cask "octave-app"
cask "osxfuse"
cask "pgadmin4"
cask "pilemd"
cask "realm-browser"
cask "screenhero"
cask "skype"
cask "slack"
cask "sloth"
cask "spectacle"
cask "station"
cask "tipp10"
cask "vagrant"
cask "veracrypt"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zerotier-one"
